web.local/app/Controllers/Home.php

    public function listar()
    {
        $table = new \CodeIgniter\View\table([
            'table_open' => '<table id="listar" class="table">'
        ]);

        $projeto_model = new ProjetoModel();
        $projetos = $projeto_model
                            ->findAll();
---
SELECT *
FROM `projetos`

    public function cadastrar()
    {
        $dados = $this->request
                        ->getPost();
        $projeto_model = new ProjetoModel();
        $projeto_model->insert($dados);
---
INSERT INTO `projetos` (`nomeProjeto`, `descricaoProjeto`, `resumoProjeto`, `validado`) VALUES ('Desenvolvimento de Materiais Sustentáveis para Construção Civil', 'Desenvolvimento de Materiais Sustentáveis para Construção Civil', 'Desenvolvimento de Materiais Sustentáveis para Construção Civil', 'NAO ')