web.local/app/Controllers/Login.php

SELECT *
FROM `login`
WHERE `Usuario` = 'admin'
AND `Senha` = 'admin'
 LIMIT 1
---
    public function paginaAvaliador()
    {
        $dados = $this->request->getVar();
        $usuario_model = new AvaliadorLogin();

        $login = $usuario_model
        ->where('login', $dados['login'])
        ->where('senha', $dados['senha'])
        ->first();