web.local/app/Controllers/Projetos.php

SELECT *
FROM `projetos`
WHERE `projetos`.`id` = '57'
SELECT *
FROM `avaliador`
---
    public function listarProjeto($id)
    {
        $projeto_model = new \App\Models\ProjetoModel();
        $projetos = $projeto_model->find($id);

        $avaliador_model = new \App\Models\AvaliadorModel();
        $avaliador = $avaliador_model->findAll();

SELECT *
FROM `avaliador`
---
    public function listarAvaliadorPorProjeto($id)
    {
        $avaliador_model = new \App\Models\AvaliadorProjeto();
        $avaliador = $avaliador_model->findAll();

        $data['avaliadoresprojeto'] = $avaliador;

        $table = new \CodeIgniter\View\table([
                'table_open' => '<table id="listarAvaliadorPorProjeto" class="table">']);
        $avaliador_model = new \App\Models\AvaliadorProjeto();
        $avaliador = $avaliador_model->findAll();

SELECT *
FROM `avaliador`
---
    public function listarAvaliador()
    {
        $table = new \CodeIgniter\View\table([
            'table_open' => '<table id="listarAvaliador" class="table">'
        ]);

        $avaliador_model = new AvaliadorModel();
        $avaliador = $avaliador_model
                            ->findAll();