web.local/app/Models/AvaliacaoModel.php

    public function getProjetosComMedia()
    {
    return $this->db->table('projetos')
                    ->select('projetos.*, AVG(avaliacao.media) as media')
                    ->join('avaliacao', 'avaliacao.IdProjeto = projetos.id', 'left')
                    ->groupBy('projetos.id')
                    ->having('media >=', 6)
                    ->get()
                    ->getResultArray();
---
SELECT `projetos`.*, AVG(avaliacao.media) as media
FROM `projetos`
LEFT JOIN `avaliacao` ON `avaliacao`.`IdProjeto` = `projetos`.`id`
GROUP BY `projetos`.`id`
HAVING `media` >= 6